flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_template/main.c
}

#else
void uart_event_handle(app_uart_evt_t * p_event)
{
	
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}
#endif


void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for application main entry.
 */
//static void uart_getline(uint8_t * line)
//{
//    uint8_t i = 0, ch = 0;
//    uint32_t err_code;

//		do {
//			err_code = app_uart_get(&ch);
//			if (NRF_ERROR_NOT_FOUND == err_code)
//			{
//				sd_app_evt_wait();
//			}
//			else if (NRF_SUCCESS == err_code)   
//			{
//				line[i++] = ch;
//			}
//			else
//			{
//				APP_ERROR_CHECK(err_code);
//			}
//		}
//		while (ch != '\n');
//}

/**@brief Function to start scanning.
 */
static const ble_gap_scan_params_t m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,
    #if (NRF_SD_BLE_API_VERSION == 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif
    #if (NRF_SD_BLE_API_VERSION == 3)
        .use_whitelist = 0,
    #endif
};

static void scan_start(void)
{
    ret_code_t ret;

    ret = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(ret);

    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}


int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;
		int8_t sensor_status;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
		ele_mach_init();  //电机初始化
		voice_chip_init();  //语音芯片初始化
		adc_config_init();  //ADC 初始化
		modem_2g_init(MODME_CONTRL_PIN);
		modem_2g_open(MODME_CONTRL_PIN); //开机打开2G模块，进入测试
		nrf_delay_ms(500);
		uart_init();
		sensor_status = sensor_type_auto_maching_init(); //初始化gsensor
		if(sensor_status != 1){
			NRF_LOG_INFO("sensor error\r\n");
		}else{
			open_sensor_monitor(1);
		}
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Template started\r\n");
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    // Enter main loop.
		scan_start();
		
    for (;;)
    {	
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
